# Copilot + GitHub
GitHub.copilot
GitHub.copilot-chat
GitHub.vscode-pull-request-github
github.vscode-github-actions

# Core productivity
eamodio.gitlens
donjayamanne.githistory
usernamehw.errorlens
wayou.vscode-todo-highlight
christian-kohler.path-intellisense
streetsidesoftware.code-spell-checker
ms-vscode.hexeditor
ritwickdey.LiveServer
EditorConfig.EditorConfig

# Frontend / web / business sites
dbaeumer.vscode-eslint
esbenp.prettier-vscode
bradlc.vscode-tailwindcss
formulahendry.auto-rename-tag
ecmel.vscode-html-css
ms-vscode.vscode-typescript-next
Vue.volar
svelte.svelte-vscode
angular.ng-template
astro-build.astro
Prisma.prisma
GraphQL.vscode-graphql
unifiedjs.vscode-mdx

# Accessibility / SEO / quality
deque-systems.vscode-axe-linter
bierner.lit-html
stylelint.vscode-stylelint

# Backend / APIs / DevOps
rangav.vscode-thunder-client
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
redhat.vscode-yaml
ms-kubernetes-tools.vscode-kubernetes-tools
hashicorp.terraform

# Python
ms-python.python
ms-python.vscode-pylance
ms-python.black-formatter
charliermarsh.ruff

# .NET / C# / desktop
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime

# Go / Rust / TOML
golang.go
rust-lang.rust-analyzer
tamasfe.even-better-toml

# PowerShell / Windows automation
ms-vscode.powershell

# Pixel-art / game / docs
geequlim.godot-tools
ms-dotnettools.unity
ms-vscode.cpptools
ms-vscode.cmake-tools
JacquesLucke.blender-development
bierner.markdown-mermaid
shd101wyy.markdown-preview-enhanced
jebbs.plantuml

# Android / hybrid apps
redhat.java
vscjava.vscode-java-pack

# UI/UX themes
pkief.material-icon-theme
zhuangtongfa.material-theme
